{
  "_name_or_path": "FacebookAI/xlm-roberta-large",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "CO-FA-*-*-*-*",
    "1": "CO-Mod-*-*-*-*",
    "2": "CO-IF-AC-RF-RPD-*",
    "3": "CO-IF-AC-RF-RPA-*",
    "4": "CO-IF-AC-RF-SRx-*",
    "5": "CO-IF-AC-RF-RLS-SR",
    "6": "CO-IF-AC-RF-RLS-PS",
    "7": "CO-IF-AC-RF-RLS-ES",
    "8": "CO-IF-AC-RF-RLS-H",
    "9": "CO-IF-AC-RF-RLS-L",
    "10": "CO-IF-AC-RF-RC-*",
    "11": "CO-IF-AC-RF-RTP-*",
    "12": "CO-IF-AC-RF-RCD-*",
    "13": "CO-IF-AC-RE-RCR-*",
    "14": "CO-IF-AC-RE-RES-*",
    "15": "CO-IF-AO-*-ROW-*",
    "16": "CO-IF-AO-*-ICO-*",
    "17": "CO-IF-Mot-*-RFC-*",
    "18": "CO-IF-Mot-*-IAC-*",
    "19": "CO-IF-Mot-*-ITA-*",
    "20": "CO-IF-Mot-*-IEM-*",
    "21": "CO-IF-Mot-*-RS-*",
    "22": "CO-IF-RA-*-RP-*",
    "23": "CO-IF-RA-*-RAP-*",
    "24": "CO-IF-RA-*-N-RAFa",
    "25": "CO-IF-RA-*-N-RAFr",
    "26": "CO-IF-HP-*-ITFE-*",
    "27": "CO-IF-HP-*-IPFR-*",
    "28": "CO-IF-HP-*-IF-*",
    "29": "CO-IF-HP-*-IW-*",
    "30": "CO-IF-HP-*-ICO-*",
    "31": "CO-IF-HP-*-PP-IA",
    "32": "CO-IF-HP-*-IEA",
    "33": "CO-IF-HP-*-PP-IW",
    "34": "CO-FC-*-*-F-*",
    "35": "CO-FC-*-*-OPR-*",
    "36": "CO-O-*-*-O-*",
    "37": "CO-O-*-*-UCO-*",
    "38": "CO-O-*-*-PI-*",
    "39": "CO-O-*-*-ST-*",
    "40": "CL-FB-*-*-*-*",
    "41": "CL-E-*-*-PT-*",
    "42": "CL-E-*-*-ECC-*",
    "43": "CL-E-*-*-ECP-*",
    "44": "CL-IF-ACP-*-PS-*",
    "45": "CL-IF-ACP-*-PD-*",
    "46": "CL-IF-ACP-*-DPD-*",
    "47": "CL-IF-ACP-*-FPA-*",
    "48": "CL-IF-ACP-*-OE-*",
    "49": "CL-IF-ACP-*-Cons-*",
    "50": "CL-IF-ACP-*-Rej-*",
    "51": "CL-IF-ACP-*-Req-*",
    "52": "CL-IF-AO-*-Obj-*",
    "53": "CL-IF-AO-*-Ext-*",
    "54": "CL-IF-Mot-*-FC-*",
    "55": "CL-IF-Mot-*-RC-*",
    "56": "CL-IF-RA-*-RF-*",
    "57": "CL-IF-RA-*-RP-*",
    "58": "CL-IF-HP-*-PosF-*",
    "59": "CL-IF-HP-*-PosFR-*",
    "60": "CL-IF-HP-*-NegFR-*",
    "61": "CL-IF-HP-*-RepRA-*",
    "62": "CL-IF-HP-*-Succ-*",
    "63": "CL-IF-HP-*-Fail-*",
    "64": "CL-FC-*-*-F-*",
    "65": "CL-FC-*-*-UPR-*",
    "66": "CL-O-*-*-O-*",
    "67": "CL-O-*-*-UCO-*"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "CL-E-*-*-ECC-*": 42,
    "CL-E-*-*-ECP-*": 43,
    "CL-E-*-*-PT-*": 41,
    "CL-FB-*-*-*-*": 40,
    "CL-FC-*-*-F-*": 64,
    "CL-FC-*-*-UPR-*": 65,
    "CL-IF-ACP-*-Cons-*": 49,
    "CL-IF-ACP-*-DPD-*": 46,
    "CL-IF-ACP-*-FPA-*": 47,
    "CL-IF-ACP-*-OE-*": 48,
    "CL-IF-ACP-*-PD-*": 45,
    "CL-IF-ACP-*-PS-*": 44,
    "CL-IF-ACP-*-Rej-*": 50,
    "CL-IF-ACP-*-Req-*": 51,
    "CL-IF-AO-*-Ext-*": 53,
    "CL-IF-AO-*-Obj-*": 52,
    "CL-IF-HP-*-Fail-*": 63,
    "CL-IF-HP-*-NegFR-*": 60,
    "CL-IF-HP-*-PosF-*": 58,
    "CL-IF-HP-*-PosFR-*": 59,
    "CL-IF-HP-*-RepRA-*": 61,
    "CL-IF-HP-*-Succ-*": 62,
    "CL-IF-Mot-*-FC-*": 54,
    "CL-IF-Mot-*-RC-*": 55,
    "CL-IF-RA-*-RF-*": 56,
    "CL-IF-RA-*-RP-*": 57,
    "CL-O-*-*-O-*": 66,
    "CL-O-*-*-UCO-*": 67,
    "CO-FA-*-*-*-*": 0,
    "CO-FC-*-*-F-*": 34,
    "CO-FC-*-*-OPR-*": 35,
    "CO-IF-AC-RE-RCR-*": 13,
    "CO-IF-AC-RE-RES-*": 14,
    "CO-IF-AC-RF-RC-*": 10,
    "CO-IF-AC-RF-RCD-*": 12,
    "CO-IF-AC-RF-RLS-ES": 7,
    "CO-IF-AC-RF-RLS-H": 8,
    "CO-IF-AC-RF-RLS-L": 9,
    "CO-IF-AC-RF-RLS-PS": 6,
    "CO-IF-AC-RF-RLS-SR": 5,
    "CO-IF-AC-RF-RPA-*": 3,
    "CO-IF-AC-RF-RPD-*": 2,
    "CO-IF-AC-RF-RTP-*": 11,
    "CO-IF-AC-RF-SRx-*": 4,
    "CO-IF-AO-*-ICO-*": 16,
    "CO-IF-AO-*-ROW-*": 15,
    "CO-IF-HP-*-ICO-*": 30,
    "CO-IF-HP-*-IEA": 32,
    "CO-IF-HP-*-IF-*": 28,
    "CO-IF-HP-*-IPFR-*": 27,
    "CO-IF-HP-*-ITFE-*": 26,
    "CO-IF-HP-*-IW-*": 29,
    "CO-IF-HP-*-PP-IA": 31,
    "CO-IF-HP-*-PP-IW": 33,
    "CO-IF-Mot-*-IAC-*": 18,
    "CO-IF-Mot-*-IEM-*": 20,
    "CO-IF-Mot-*-ITA-*": 19,
    "CO-IF-Mot-*-RFC-*": 17,
    "CO-IF-Mot-*-RS-*": 21,
    "CO-IF-RA-*-N-RAFa": 24,
    "CO-IF-RA-*-N-RAFr": 25,
    "CO-IF-RA-*-RAP-*": 23,
    "CO-IF-RA-*-RP-*": 22,
    "CO-Mod-*-*-*-*": 1,
    "CO-O-*-*-O-*": 36,
    "CO-O-*-*-PI-*": 38,
    "CO-O-*-*-ST-*": 39,
    "CO-O-*-*-UCO-*": 37
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250004
}
